Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.1.98/atdf/PIC32MZ2025DAA169.atdf
      <value-group caption="32-bit Compare Mode bit" name="OC6CON__OC32">
         <value caption="OCxR and/or OCxRS&lt;31:0&gt; are used for comparisions to the 32-bit timer source" name="" value="0x1" />
         <value caption="OCxR and OCxRS&lt;15:0&gt; are used for comparisons to the 16-bit timer source" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="OC6CON__SIDL">
         <value caption="Discontinue operation when CPU enters Idle mode" name="" value="0x1" />
         <value caption="Continue operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Peripheral On bit" name="OC6CON__ON">
         <value caption="Output Compare peripheral is enabled" name="" value="0x1" />
         <value caption="Output Compare peripheral is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Mode Select bits" name="OC7CON__OCM">
         <value caption="PWM mode on OCx; Fault pin enabled" name="" value="0x7" />
         <value caption="PWM mode on OCx; Fault pin diabled" name="" value="0x6" />
         <value caption="Initialize OCx pin low; generate continious output pulses on OCx pin" name="" value="0x5" />
         <value caption="Initialize OCx pin low; generate single output pulse on OCx pin" name="" value="0x4" />
         <value caption="Compare event toggles OCx pin" name="" value="0x3" />
         <value caption="Initialize OCx pin high; compare event forces OCx pin low" name="" value="0x2" />
         <value caption="Initialize OCx pin low; compare event forces OCx pin high" name="" value="0x1" />
         <value caption="Output compare peripheral is disabled but continues to draw current" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Timer Select bit" name="OC7CON__OCTSEL">
         <value caption="Timery is the clock source for this Output Compare module" name="" value="0x1" />
         <value caption="Timerx is the clock source for this Output Compare module" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Fault Condition Status bit" name="OC7CON__OCFLT">
         <value caption="PWM Fault condition has occurred (cleared in HW only)" name="" value="0x1" />
         <value caption="No PWM Fault condition has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="32-bit Compare Mode bit" name="OC7CON__OC32">
         <value caption="OCxR and/or OCxRS&lt;31:0&gt; are used for comparisions to the 32-bit timer source" name="" value="0x1" />
         <value caption="OCxR and OCxRS&lt;15:0&gt; are used for comparisons to the 16-bit timer source" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="OC7CON__SIDL">
         <value caption="Discontinue operation when CPU enters Idle mode" name="" value="0x1" />
         <value caption="Continue operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Peripheral On bit" name="OC7CON__ON">
         <value caption="Output Compare peripheral is enabled" name="" value="0x1" />
         <value caption="Output Compare peripheral is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Mode Select bits" name="OC8CON__OCM">
         <value caption="PWM mode on OCx; Fault pin enabled" name="" value="0x7" />
         <value caption="PWM mode on OCx; Fault pin diabled" name="" value="0x6" />
         <value caption="Initialize OCx pin low; generate continious output pulses on OCx pin" name="" value="0x5" />
         <value caption="Initialize OCx pin low; generate single output pulse on OCx pin" name="" value="0x4" />
         <value caption="Compare event toggles OCx pin" name="" value="0x3" />
         <value caption="Initialize OCx pin high; compare event forces OCx pin low" name="" value="0x2" />
         <value caption="Initialize OCx pin low; compare event forces OCx pin high" name="" value="0x1" />
         <value caption="Output compare peripheral is disabled but continues to draw current" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Timer Select bit" name="OC8CON__OCTSEL">
         <value caption="Timery is the clock source for this Output Compare module" name="" value="0x1" />
         <value caption="Timerx is the clock source for this Output Compare module" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Fault Condition Status bit" name="OC8CON__OCFLT">
         <value caption="PWM Fault condition has occurred (cleared in HW only)" name="" value="0x1" />
         <value caption="No PWM Fault condition has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="32-bit Compare Mode bit" name="OC8CON__OC32">
         <value caption="OCxR and/or OCxRS&lt;31:0&gt; are used for comparisions to the 32-bit timer source" name="" value="0x1" />
         <value caption="OCxR and OCxRS&lt;15:0&gt; are used for comparisons to the 16-bit timer source" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="OC8CON__SIDL">
         <value caption="Discontinue operation when CPU enters Idle mode" name="" value="0x1" />
         <value caption="Continue operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Peripheral On bit" name="OC8CON__ON">
         <value caption="Output Compare peripheral is enabled" name="" value="0x1" />
         <value caption="Output Compare peripheral is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Mode Select bits" name="OC9CON__OCM">
         <value caption="PWM mode on OCx; Fault pin enabled" name="" value="0x7" />
         <value caption="PWM mode on OCx; Fault pin diabled" name="" value="0x6" />
         <value caption="Initialize OCx pin low; generate continious output pulses on OCx pin" name="" value="0x5" />
         <value caption="Initialize OCx pin low; generate single output pulse on OCx pin" name="" value="0x4" />
         <value caption="Compare event toggles OCx pin" name="" value="0x3" />
         <value caption="Initialize OCx pin high; compare event forces OCx pin low" name="" value="0x2" />
         <value caption="Initialize OCx pin low; compare event forces OCx pin high" name="" value="0x1" />
         <value caption="Output compare peripheral is disabled but continues to draw current" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Timer Select bit" name="OC9CON__OCTSEL">
         <value caption="Timery is the clock source for this Output Compare module" name="" value="0x1" />
         <value caption="Timerx is the clock source for this Output Compare module" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Fault Condition Status bit" name="OC9CON__OCFLT">
         <value caption="PWM Fault condition has occurred (cleared in HW only)" name="" value="0x1" />
         <value caption="No PWM Fault condition has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="32-bit Compare Mode bit" name="OC9CON__OC32">
         <value caption="OCxR and/or OCxRS&lt;31:0&gt; are used for comparisions to the 32-bit timer source" name="" value="0x1" />
         <value caption="OCxR and OCxRS&lt;15:0&gt; are used for comparisons to the 16-bit timer source" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="OC9CON__SIDL">
         <value caption="Discontinue operation when CPU enters Idle mode" name="" value="0x1" />
         <value caption="Continue operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Peripheral On bit" name="OC9CON__ON">
         <value caption="Output Compare peripheral is enabled" name="" value="0x1" />
         <value caption="Output Compare peripheral is disabled" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01643" name="PCACHE" version="2">
      <register-group name="PCACHE">
         <register caption="Prefetch Module Control Register" name="PRECON" offset="0x0" rw="RW" size="4">
            <bitfield caption="PFM Access Time Defined in Terms of SYSCLK Wait States bits" mask="0x00000007" name="PFMWS" values="PRECON__PFMWS" />
            <bitfield caption="Predictive Prefetch Enable bits" mask="0x00000030" name="PREFEN" values="PRECON__PREFEN" />
            <bitfield caption="Flash SEC Interrupt Enable bit" mask="0x04000000" name="PFMSECEN" values="PRECON__PFMSECEN" />
         </register>
         <register caption="Prefetch Module Status Register" name="PRESTAT" offset="0x10" rw="RW" size="4">
            <bitfield caption="Flash SEC Count bits" mask="0x000000FF" name="PFMSECCNT" values="PRESTAT__PFMSECCNT" />
            <bitfield caption="Flash Single-bit Error Corrected Status bit" mask="0x04000000" name="PFMSEC" values="PRESTAT__PFMSEC" />
            <bitfield caption="Flash Double-bit Error Detected Status bit" mask="0x08000000" name="PFMDED" values="PRESTAT__PFMDED" />
         </register>
      </register-group>
      <value-group caption="PFM Access Time Defined in Terms of SYSCLK Wait States bits" name="PRECON__PFMWS">
         <value caption="Seven Wait states" name="" value="0x7" />
         <value caption="Six Wait states" name="" value="0x6" />
         <value caption="Five Wait states" name="" value="0x5" />
         <value caption="Four Wait states" name="" value="0x4" />
         <value caption="Three Wait states" name="" value="0x3" />
         <value caption="Two Wait states" name="" value="0x2" />
         <value caption="One Wait state" name="" value="0x1" />
         <value caption="Zero Wait states" name="" value="0x0" />
      </value-group>
      <value-group caption="Predictive Prefetch Enable bits" name="PRECON__PREFEN">
         <value caption="Enable predictive prefetch for any address" name="" value="0x3" />
         <value caption="Enable predictive prefetch for CPU instructions and CPU data" name="" value="0x2" />
         <value caption="Enable predictive prefetch for CPU instructions only" name="" value="0x1" />
         <value caption="Disable predictive prefetch" name="" value="0x0" />
      </value-group>
      <value-group caption="Flash SEC Interrupt Enable bit" name="PRECON__PFMSECEN">
         <value caption="Generate an interrupt when the PFMSEC bit (PRESTAT) is set" name="" value="0x1" />
         <value caption="Do not generate an interrupt when the PFMSEC bit is set" name="" value="0x0" />
      </value-group>
      <value-group caption="Flash SEC Count bits" name="PRESTAT__PFMSECCNT">
         <value caption="SEC count of 255" name="" value="0xff" />
         <value caption="SEC count of 254" name="" value="0xfe" />
         <value caption="SEC count of 1" name="" value="0x1" />
         <value caption="SEC count of 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Flash Single-bit Error Corrected Status bit" name="PRESTAT__PFMSEC">
         <value caption="A SEC error occurred when PFMSECCNT was equal to zero" name="" value="0x1" />
         <value caption="A SEC error has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Flash Double-bit Error Detected Status bit" name="PRESTAT__PFMDED">
         <value caption="A DED error has occurred" name="" value="0x1" />
         <value caption="A DED error has not occurred" name="" value="0x0" />
      </value-group>
   </module>
