Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.1.98/atdf/PIC32MZ2025DAA169.atdf
         <register caption="System Bus Target 'x' Error Control Register" name="SBT9ECON" offset="0x10c08" rw="RW" size="4">
            <bitfield caption="Error Control bit" mask="0x01000000" name="ERRP" values="SBT9ECON__ERRP" />
         </register>
         <register caption="System Bus Target 'x' Error Control Register" name="SBT10ECON" offset="0x11008" rw="RW" size="4">
            <bitfield caption="Error Control bit" mask="0x01000000" name="ERRP" values="SBT10ECON__ERRP" />
         </register>
         <register caption="System Bus Target 'x' Error Control Register" name="SBT11ECON" offset="0x11408" rw="RW" size="4">
            <bitfield caption="Error Control bit" mask="0x01000000" name="ERRP" values="SBT11ECON__ERRP" />
         </register>
         <register caption="System Bus Target 'x' Error Control Register" name="SBT12ECON" offset="0x11808" rw="RW" size="4">
            <bitfield caption="Error Control bit" mask="0x01000000" name="ERRP" values="SBT12ECON__ERRP" />
         </register>
         <register caption="System Bus Target 'x' Error Control Register" name="SBT13ECON" offset="0x20408" rw="RW" size="4">
            <bitfield caption="Error Control bit" mask="0x01000000" name="ERRP" values="SBT13ECON__ERRP" />
         </register>
         <register caption="System Bus Target 'x' Error Control Register" name="SBT14ECON" offset="0x20808" rw="RW" size="4">
            <bitfield caption="Error Control bit" mask="0x01000000" name="ERRP" values="SBT14ECON__ERRP" />
         </register>
         <register caption="System Bus Target 'x' Error Control Register" name="SBT15ECON" offset="0x20c08" rw="RW" size="4">
            <bitfield caption="Error Control bit" mask="0x01000000" name="ERRP" values="SBT15ECON__ERRP" />
         </register>
         <register caption="System Bus Target 'x' Error Control Register" name="SBT16ECON" offset="0x34408" rw="RW" size="4">
            <bitfield caption="Error Control bit" mask="0x01000000" name="ERRP" values="SBT16ECON__ERRP" />
         </register>
         <register caption="System Bus Target 'x' Single Error Clear Register" name="SBT0ECLRS" offset="0x10" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="System Bus Target 'x' Single Error Clear Register" name="SBT1ECLRS" offset="0x410" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="System Bus Target 'x' Single Error Clear Register" name="SBT2ECLRS" offset="0x810" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="System Bus Target 'x' Single Error Clear Register" name="SBT3ECLRS" offset="0xc10" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="System Bus Target 'x' Single Error Clear Register" name="SBT4ECLRS" offset="0x1010" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="System Bus Target 'x' Single Error Clear Register" name="SBT5ECLRS" offset="0x1410" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="System Bus Target 'x' Single Error Clear Register" name="SBT6ECLRS" offset="0x1810" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="System Bus Target 'x' Single Error Clear Register" name="SBT7ECLRS" offset="0x10410" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="System Bus Target 'x' Single Error Clear Register" name="SBT8ECLRS" offset="0x10810" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="System Bus Target 'x' Single Error Clear Register" name="SBT9ECLRS" offset="0x10c10" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="System Bus Target 'x' Single Error Clear Register" name="SBT10ECLRS" offset="0x11010" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="System Bus Target 'x' Single Error Clear Register" name="SBT11ECLRS" offset="0x11410" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="System Bus Target 'x' Single Error Clear Register" name="SBT12ECLRS" offset="0x11810" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="System Bus Target 'x' Single Error Clear Register" name="SBT13ECLRS" offset="0x20410" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="System Bus Target 'x' Single Error Clear Register" name="SBT14ECLRS" offset="0x20810" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="System Bus Target 'x' Single Error Clear Register" name="SBT15ECLRS" offset="0x20c10" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="System Bus Target 'x' Single Error Clear Register" name="SBT16ECLRS" offset="0x34410" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="System Bus Target 'x' Multiple Error Clear Register" name="SBT0ECLRM" offset="0x18" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="System Bus Target 'x' Multiple Error Clear Register" name="SBT1ECLRM" offset="0x418" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="System Bus Target 'x' Multiple Error Clear Register" name="SBT2ECLRM" offset="0x818" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="System Bus Target 'x' Multiple Error Clear Register" name="SBT3ECLRM" offset="0xc18" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR" />
         </register>
