Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.1.98/atdf/PIC32MZ2025DAA169.atdf
         <register caption="USB Endpoint 2 Receive Address Register" name="USBE2RXA" offset="0x94" rw="RW" size="4">
            <bitfield mask="0x0000007F" name="RXFADDR" />
            <bitfield mask="0x007F0000" name="RXHUBADD" />
            <bitfield caption="RX Hub Multiple Translators bit" mask="0x00800000" name="MULTTRAN" values="USBE2RXA__MULTTRAN" />
            <bitfield mask="0x7F000000" name="RXHUBPRT" />
         </register>
         <register caption="USB Endpoint 3 Transmit Address Register" name="USBE3TXA" offset="0x98" rw="RW" size="4">
            <bitfield mask="0x0000007F" name="TXFADDR" />
            <bitfield mask="0x007F0000" name="TXHUBADD" />
            <bitfield caption="TX Hub Multiple Translators bit" mask="0x00800000" name="MULTTRAN" values="USBE3TXA__MULTTRAN" />
            <bitfield mask="0x7F000000" name="TXHUBPRT" />
         </register>
         <register caption="USB Endpoint 3 Receive Address Register" name="USBE3RXA" offset="0x9c" rw="RW" size="4">
            <bitfield mask="0x0000007F" name="RXFADDR" />
            <bitfield mask="0x007F0000" name="RXHUBADD" />
            <bitfield caption="RX Hub Multiple Translators bit" mask="0x00800000" name="MULTTRAN" values="USBE3RXA__MULTTRAN" />
            <bitfield mask="0x7F000000" name="RXHUBPRT" />
         </register>
         <register caption="USB Endpoint 4 Transmit Address Register" name="USBE4TXA" offset="0xa0" rw="RW" size="4">
            <bitfield mask="0x0000007F" name="TXFADDR" />
            <bitfield mask="0x007F0000" name="TXHUBADD" />
            <bitfield caption="TX Hub Multiple Translators bit" mask="0x00800000" name="MULTTRAN" values="USBE4TXA__MULTTRAN" />
            <bitfield mask="0x7F000000" name="TXHUBPRT" />
         </register>
         <register caption="USB Endpoint 4 Receive Address Register" name="USBE4RXA" offset="0xa4" rw="RW" size="4">
            <bitfield mask="0x0000007F" name="RXFADDR" />
            <bitfield mask="0x007F0000" name="RXHUBADD" />
            <bitfield caption="RX Hub Multiple Translators bit" mask="0x00800000" name="MULTTRAN" values="USBE4RXA__MULTTRAN" />
            <bitfield mask="0x7F000000" name="RXHUBPRT" />
         </register>
         <register caption="USB Endpoint 5 Transmit Address Register" name="USBE5TXA" offset="0xa8" rw="RW" size="4">
            <bitfield mask="0x0000007F" name="TXFADDR" />
            <bitfield mask="0x007F0000" name="TXHUBADD" />
            <bitfield caption="TX Hub Multiple Translators bit" mask="0x00800000" name="MULTTRAN" values="USBE5TXA__MULTTRAN" />
            <bitfield mask="0x7F000000" name="TXHUBPRT" />
         </register>
         <register caption="USB Endpoint 5 Receive Address Register" name="USBE5RXA" offset="0xac" rw="RW" size="4">
            <bitfield mask="0x0000007F" name="RXFADDR" />
            <bitfield mask="0x007F0000" name="RXHUBADD" />
            <bitfield caption="RX Hub Multiple Translators bit" mask="0x00800000" name="MULTTRAN" values="USBE5RXA__MULTTRAN" />
            <bitfield mask="0x7F000000" name="RXHUBPRT" />
         </register>
         <register caption="USB Endpoint 6 Transmit Address Register" name="USBE6TXA" offset="0xb0" rw="RW" size="4">
            <bitfield mask="0x0000007F" name="TXFADDR" />
            <bitfield mask="0x007F0000" name="TXHUBADD" />
            <bitfield caption="TX Hub Multiple Translators bit" mask="0x00800000" name="MULTTRAN" values="USBE6TXA__MULTTRAN" />
            <bitfield mask="0x7F000000" name="TXHUBPRT" />
         </register>
         <register caption="USB Endpoint 6 Receive Address Register" name="USBE6RXA" offset="0xb4" rw="RW" size="4">
            <bitfield mask="0x0000007F" name="RXFADDR" />
            <bitfield mask="0x007F0000" name="RXHUBADD" />
            <bitfield caption="RX Hub Multiple Translators bit" mask="0x00800000" name="MULTTRAN" values="USBE6RXA__MULTTRAN" />
            <bitfield mask="0x7F000000" name="RXHUBPRT" />
         </register>
         <register caption="USB Endpoint 7 Transmit Address Register" name="USBE7TXA" offset="0xb8" rw="RW" size="4">
            <bitfield mask="0x0000007F" name="TXFADDR" />
            <bitfield mask="0x007F0000" name="TXHUBADD" />
            <bitfield caption="TX Hub Multiple Translators bit" mask="0x00800000" name="MULTTRAN" values="USBE7TXA__MULTTRAN" />
            <bitfield mask="0x7F000000" name="TXHUBPRT" />
         </register>
         <register caption="USB Endpoint 7 Receive Address Register" name="USBE7RXA" offset="0xbc" rw="RW" size="4">
            <bitfield mask="0x0000007F" name="RXFADDR" />
            <bitfield mask="0x007F0000" name="RXHUBADD" />
            <bitfield caption="RX Hub Multiple Translators bit" mask="0x00800000" name="MULTTRAN" values="USBE7RXA__MULTTRAN" />
            <bitfield mask="0x7F000000" name="RXHUBPRT" />
         </register>
         <register caption="" name="USBE0CSR0" offset="0x100" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="TXMAXP" />
            <bitfield mask="0x00010000" name="RXRDY" />
            <bitfield mask="0x00020000" name="TXRDY" />
            <bitfield mask="0x00040000" name="STALLED" />
            <bitfield mask="0x00080000" name="SETUP" />
            <bitfield mask="0x00100000" name="ERROR" />
            <bitfield mask="0x00200000" name="REQPKT" />
            <bitfield mask="0x00400000" name="STATUS" />
            <bitfield mask="0x00800000" name="NAKTO" />
            <bitfield mask="0x01000000" name="FLUSH" />
            <bitfield mask="0x02000000" name="DT" />
            <bitfield mask="0x04000000" name="DTWE" />
         </register>
         <register caption="" name="USBE0CSR2" offset="0x108" rw="RW" size="4">
            <bitfield mask="0x0000007F" name="RXCNT" />
            <bitfield mask="0x00C00000" name="SPEED" />
            <bitfield mask="0x0F000000" name="NAKLIM" />
         </register>
         <register caption="" name="USBE0CSR3" offset="0x10c" rw="RW" size="4">
            <bitfield mask="0x01000000" name="UTMIDWID" />
            <bitfield mask="0x02000000" name="SOFTCONE" />
            <bitfield mask="0x04000000" name="DYNFIFOS" />
            <bitfield mask="0x08000000" name="HBTXEN" />
            <bitfield mask="0x10000000" name="HBRXEN" />
            <bitfield mask="0x20000000" name="BIGEND" />
            <bitfield mask="0x40000000" name="MPTXEN" />
            <bitfield mask="0x80000000" name="MPRXEN" />
         </register>
         <register caption="" name="USBE1CSR0" offset="0x110" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="TXMAXP" />
            <bitfield mask="0x0000F800" name="MULT" />
            <bitfield mask="0x00010000" name="TXPKTRDY" />
            <bitfield mask="0x00020000" name="FIFONE" />
            <bitfield mask="0x00040000" name="ERROR" />
            <bitfield mask="0x00080000" name="FLUSH" />
            <bitfield mask="0x00100000" name="SETUPPKT" />
            <bitfield mask="0x00200000" name="RXSTALL" />
            <bitfield mask="0x00400000" name="CLRDT" />
            <bitfield mask="0x00800000" name="NAKTMOUT" />
            <bitfield mask="0x01000000" name="DATATGGL" />
            <bitfield mask="0x02000000" name="DTWREN" />
            <bitfield mask="0x04000000" name="DMAREQMD" />
            <bitfield mask="0x08000000" name="FRCDATTG" />
            <bitfield mask="0x10000000" name="DMAREQEN" />
            <bitfield mask="0x20000000" name="MODE" />
            <bitfield mask="0x80000000" name="AUTOSET" />
         </register>
         <register caption="" name="USBE1CSR1" offset="0x114" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="RXMAXP" />
            <bitfield mask="0x0000F800" name="MULT" />
            <bitfield mask="0x00010000" name="RXPKTRDY" />
            <bitfield mask="0x00020000" name="FIFOFULL" />
            <bitfield mask="0x00040000" name="ERROR" />
            <bitfield mask="0x00080000" name="DERRNAKT" />
            <bitfield mask="0x00100000" name="FLUSH" />
            <bitfield mask="0x00200000" name="REQPKT" />
            <bitfield mask="0x00400000" name="RXSTALL" />
            <bitfield mask="0x00800000" name="CLRDT" />
            <bitfield mask="0x01000000" name="INCOMPRX" />
            <bitfield mask="0x02000000" name="DATATGGL" />
            <bitfield mask="0x04000000" name="DATATWEN" />
            <bitfield mask="0x08000000" name="DMAREQMD" />
            <bitfield mask="0x10000000" name="PIDERR" />
            <bitfield mask="0x20000000" name="DMAREQEN" />
            <bitfield mask="0x40000000" name="AUTORQ" />
            <bitfield mask="0x80000000" name="AUTOCLR" />
         </register>
         <register caption="" name="USBE1CSR2" offset="0x118" rw="RW" size="4">
            <bitfield mask="0x00003FFF" name="RXCNT" />
            <bitfield mask="0x000F0000" name="TEP" />
            <bitfield mask="0x00300000" name="PROTOCOL" />
            <bitfield mask="0x00C00000" name="SPEED" />
            <bitfield mask="0xFF000000" name="TXINTERV" />
         </register>
         <register caption="" name="USBE1CSR3" offset="0x11c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="TEP" />
            <bitfield mask="0x00000030" name="PROTOCOL" />
            <bitfield mask="0x000000C0" name="SPEED" />
            <bitfield mask="0x0000FF00" name="RXINTERV" />
            <bitfield mask="0x0F000000" name="TXFIFOSZ" />
            <bitfield mask="0xF0000000" name="RXFIFOSZ" />
         </register>
         <register caption="" name="USBE2CSR0" offset="0x120" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="TXMAXP" />
            <bitfield mask="0x0000F800" name="MULT" />
            <bitfield mask="0x00010000" name="TXPKTRDY" />
            <bitfield mask="0x00020000" name="FIFONE" />
            <bitfield mask="0x00040000" name="ERROR" />
            <bitfield mask="0x00080000" name="FLUSH" />
            <bitfield mask="0x00100000" name="SETUPPKT" />
            <bitfield mask="0x00200000" name="RXSTALL" />
            <bitfield mask="0x00400000" name="CLRDT" />
            <bitfield mask="0x00800000" name="NAKTMOUT" />
            <bitfield mask="0x01000000" name="DATATGGL" />
            <bitfield mask="0x02000000" name="DTWREN" />
            <bitfield mask="0x04000000" name="DMAREQMD" />
            <bitfield mask="0x08000000" name="FRCDATTG" />
            <bitfield mask="0x10000000" name="DMAREQEN" />
            <bitfield mask="0x20000000" name="MODE" />
            <bitfield mask="0x80000000" name="AUTOSET" />
         </register>
         <register caption="" name="USBE2CSR1" offset="0x124" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="RXMAXP" />
            <bitfield mask="0x0000F800" name="MULT" />
            <bitfield mask="0x00010000" name="RXPKTRDY" />
            <bitfield mask="0x00020000" name="FIFOFULL" />
            <bitfield mask="0x00040000" name="ERROR" />
            <bitfield mask="0x00080000" name="DERRNAKT" />
            <bitfield mask="0x00100000" name="FLUSH" />
            <bitfield mask="0x00200000" name="REQPKT" />
            <bitfield mask="0x00400000" name="RXSTALL" />
            <bitfield mask="0x00800000" name="CLRDT" />
            <bitfield mask="0x01000000" name="INCOMPRX" />
            <bitfield mask="0x02000000" name="DATATGGL" />
            <bitfield mask="0x04000000" name="DATATWEN" />
            <bitfield mask="0x08000000" name="DMAREQMD" />
            <bitfield mask="0x10000000" name="PIDERR" />
            <bitfield mask="0x20000000" name="DMAREQEN" />
            <bitfield mask="0x40000000" name="AUTORQ" />
            <bitfield mask="0x80000000" name="AUTOCLR" />
         </register>
         <register caption="" name="USBE2CSR2" offset="0x128" rw="RW" size="4">
            <bitfield mask="0x00003FFF" name="RXCNT" />
            <bitfield mask="0x000F0000" name="TEP" />
            <bitfield mask="0x00300000" name="PROTOCOL" />
            <bitfield mask="0x00C00000" name="SPEED" />
            <bitfield mask="0xFF000000" name="TXINTERV" />
         </register>
         <register caption="" name="USBE2CSR3" offset="0x12c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="TEP" />
            <bitfield mask="0x00000030" name="PROTOCOL" />
            <bitfield mask="0x000000C0" name="SPEED" />
            <bitfield mask="0x0000FF00" name="RXINTERV" />
            <bitfield mask="0x0F000000" name="TXFIFOSZ" />
            <bitfield mask="0xF0000000" name="RXFIFOSZ" />
         </register>
         <register caption="" name="USBE3CSR0" offset="0x130" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="TXMAXP" />
            <bitfield mask="0x0000F800" name="MULT" />
            <bitfield mask="0x00010000" name="TXPKTRDY" />
            <bitfield mask="0x00020000" name="FIFONE" />
            <bitfield mask="0x00040000" name="ERROR" />
            <bitfield mask="0x00080000" name="FLUSH" />
            <bitfield mask="0x00100000" name="SETUPPKT" />
            <bitfield mask="0x00200000" name="RXSTALL" />
            <bitfield mask="0x00400000" name="CLRDT" />
            <bitfield mask="0x00800000" name="NAKTMOUT" />
            <bitfield mask="0x01000000" name="DATATGGL" />
            <bitfield mask="0x02000000" name="DTWREN" />
            <bitfield mask="0x04000000" name="DMAREQMD" />
            <bitfield mask="0x08000000" name="FRCDATTG" />
            <bitfield mask="0x10000000" name="DMAREQEN" />
            <bitfield mask="0x20000000" name="MODE" />
            <bitfield mask="0x80000000" name="AUTOSET" />
         </register>
